{
  "timeline": [
    {
      "year": "2014",
      "title": "First Job",
      "description": "Started at PetSmart as an overnight stocker. First work experience - building the foundation.",
      "type": "foundation",
      "icon": "briefcase"
    },
    {
      "year": "2015",
      "title": "GNC & Supplement Industry",
      "description": "Joined GNC and learned the supplement industry from the inside. This is where the Serenergy idea was born - saw the market opportunity firsthand.",
      "type": "foundation",
      "icon": "shopping-bag"
    },
    {
      "year": "2017",
      "title": "Serenergy Founded",
      "description": "Quit to go all in on the dream. Launched a nootropic energy shot company at 20. 2oz caffeine + L-theanine shots, 'Serene Energy' branding. Built everything solo: formulation, brand, packaging, sales, supply chain.",
      "type": "entrepreneurship",
      "icon": "rocket",
      "highlight": true
    },
    {
      "year": "2018",
      "title": "Traction & Loss",
      "description": "Appeared on local TV twice. Sold thousands of units. Got to VitaminShoppe NATIONAL BUYER meetings - distribution was within reach. Then Pilotworks shut down in October, taking production capability overnight.",
      "type": "entrepreneurship",
      "icon": "tv",
      "highlight": true
    },
    {
      "year": "2019",
      "title": "The Pivot",
      "description": "Made the hard decision to pivot to IT. Started self-teaching everything - no bootcamp, no CS degree. VitaminShoppe Keyholder by day, learning systems and scripting by night.",
      "type": "transition",
      "icon": "refresh-cw"
    },
    {
      "year": "2021",
      "title": "VitaminShoppe IT",
      "description": "Internal promotion from retail Keyholder to IT Service Desk. VitaminShoppe saw something in me. Self-taught the skills, earned the opportunity. Remote position supporting 5,000+ users.",
      "type": "career",
      "icon": "headphones",
      "highlight": true
    },
    {
      "year": "2022",
      "title": "AI Early Adopter",
      "description": "API access to GPT-3.5/ChatGPT playground in August - three months before the November public launch. Top 0.1% of early users (ChatGPT Wrapped verified). Started building with LLMs immediately.",
      "type": "ai",
      "icon": "cpu",
      "highlight": true
    },
    {
      "year": "2023",
      "title": "AWS Certified",
      "description": "Earned AWS Solutions Architect Associate certification. Completed Cloud Resume Challenge. Continued deepening technical expertise across cloud and automation.",
      "type": "career",
      "icon": "award"
    },
    {
      "year": "2024",
      "title": "System Admin + Aelorians",
      "description": "System Administrator at TransCore. Started building Aelorians AI companion platform. Invested in RTX 5090 for local model fine-tuning. Now building AI systems, not just using AI tools.",
      "type": "current",
      "icon": "terminal",
      "highlight": true
    },
    {
      "year": "2025",
      "title": "What's Next",
      "description": "Looking for the right opportunity to combine technical depth with customer understanding and builder mentality. AI-focused roles where I can work on technology that genuinely helps people.",
      "type": "future",
      "icon": "arrow-right"
    }
  ]
}
