{
  "timeline": [
    {
      "year": "2015",
      "title": "Retail Foundation",
      "description": "Started in retail, building the foundation of customer service, communication, and understanding people that would inform everything that came after.",
      "type": "foundation",
      "icon": "shopping-bag"
    },
    {
      "year": "2018",
      "title": "Serenergy Founded",
      "description": "Launched a nootropic energy shot company at age 21. Caffeine + L-Theanine formula, 'serene energy' branding. Built everything solo: product, brand, sales, distribution.",
      "type": "entrepreneurship",
      "icon": "rocket",
      "highlight": true
    },
    {
      "year": "2019",
      "title": "Television & Growth",
      "description": "Appeared on local television twice. Sold thousands of units through direct sales. Got to VitaminShoppe buyer meetings for potential national distribution.",
      "type": "entrepreneurship",
      "icon": "tv"
    },
    {
      "year": "2020",
      "title": "The Pivot",
      "description": "Pilotworks (commercial kitchen partner) shut down unexpectedly, collapsing supply chain. Made the hard decision to pivot to IT. Started self-teaching—no bootcamp, no CS degree.",
      "type": "transition",
      "icon": "refresh-cw"
    },
    {
      "year": "2021",
      "title": "VitaminShoppe IT",
      "description": "First IT role as Service Desk Analyst. Remote position supporting 5,000+ users across corporate and retail. Learned enterprise IT from the ground up.",
      "type": "career",
      "icon": "headphones"
    },
    {
      "year": "2022",
      "title": "AI Early Adopter",
      "description": "Gained access to ChatGPT API and playground in August 2022—three months before the public launch. Top 0.1% of early users (verified by ChatGPT Wrapped). Started building with LLMs immediately.",
      "type": "ai",
      "icon": "cpu",
      "highlight": true
    },
    {
      "year": "2023",
      "title": "AWS Certified",
      "description": "Earned AWS Solutions Architect Associate certification. Completed Cloud Resume Challenge. Continued deepening technical expertise across cloud and automation.",
      "type": "career",
      "icon": "award"
    },
    {
      "year": "2024",
      "title": "System Admin + Aelorians",
      "description": "Promoted to System Administrator at TransCore. Started building Aelorians AI companion platform. Invested in RTX 5090 for local model fine-tuning.",
      "type": "current",
      "icon": "terminal",
      "highlight": true
    },
    {
      "year": "2025",
      "title": "What's Next?",
      "description": "Looking for the right opportunity to bring together entrepreneurial grit, technical depth, and genuine passion for building things that help people.",
      "type": "future",
      "icon": "arrow-right"
    }
  ]
}
